<!-- dflook/terraform-github-actions {"workspace":"early-eval","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"662ae31e8ba9a4a194c6d175d4fc236b5511afeebd2167d4f3cdf5301a8b54c2","plan_job_ref":"Job Test actions using target and replace #484 at https://github.com/dflook/terraform-github-actions/actions/runs/14501055003","plan_hash":"e148560727f233363892dba27619796cdd4d72c9e3358fc81fab2719463599a8","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __early-eval__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "difj2oHt75" -> (known after apply)
!~  foreach = "9A6vDJw3gE" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #484](https://github.com/dflook/terraform-github-actions/actions/runs/14501055003)